jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
/*
 * Copyright (c) 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <assert.h>
#include <stdio.h>
#include <string.h>
#include "fsl_os_abstraction.h"
#include "fsl_sdhc_card.h"
#include "sdmmc.h"

#if defined(FSL_SDHC_USING_BIG_ENDIAN)
#define swap_be32(x) (x)
#else
#define swap_be32(x) ((uint32_t)((((uint32_t)(x) & (uint32_t)(0xFF)) << 24)) | \
                                 (((uint32_t)(x) & (uint32_t)(0xFF00)) << 8) | \
                                 (((uint32_t)(x) & (uint32_t)(0xFF0000)) >> 8) | \
                                 (((uint32_t)(x) & (uint32_t)(0xFF000000U)) >> 24))
#endif

#define FSL_SDCARD_REQUEST_TIMEOUT 1000

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_DecodeCsd
 * Description: decode csd register
 *
 *END*********************************************************************/
static void SDCARD_DRV_DecodeCsd(uint32_t *rawCsd, sdhc_card_t *card)
{
    sdcard_csd_t *csd;
    assert(rawCsd);
    assert(card);
    csd = &(card->csd);
    csd->csdStructure = (uint8_t)((rawCsd[3] & 0xC0000000U) >> 30);
    csd->taac = (uint8_t)((rawCsd[3] & 0xFF0000) >> 16);
    csd->nsac = (uint8_t)((rawCsd[3] & 0xFF00) >> 8);
    csd->tranSpeed = (uint8_t)(rawCsd[3] & 0xFF);
    csd->ccc = (uint16_t)((rawCsd[2] & 0xFFF00000U) >> 20);
    csd->readBlkLen = (uint8_t)((rawCsd[2] & 0xF0000) >> 16);
    if (rawCsd[2] & 0x8000)
    {
        csd->flags |= SDCARD_CSD_READ_BL_PARTIAL;
    }
    if (rawCsd[2] & 0x4000)
    {
        csd->flags |= SDCARD_CSD_WRITE_BLK_MISALIGN;
    }
    if (rawCsd[2] & 0x2000)
    {
        csd->flags |= SDCARD_CSD_READ_BLK_MISALIGN;
    }
    if (rawCsd[2] & 0x1000)
    {
        csd->flags |= SDCARD_CSD_DSR_IMP;
    }
    if (csd->csdStructure == 0)
    {
        csd->cSize = (uint32_t)((rawCsd[2] & 0x3FF) << 2);
        csd->cSize |= (uint32_t)((rawCsd[1] & 0xC0000000U) >> 30);
        csd->vddRCurrMin = (uint8_t)((rawCsd[1] & 0x38000000) >> 27);
        csd->vddRCurrMax = (uint8_t)((rawCsd[1] & 0x7000000) >> 24);
        csd->vddWCurrMin = (uint8_t)((rawCsd[1] & 0xE00000) >> 20);
        csd->vddWCurrMax = (uint8_t)((rawCsd[1] & 0x1C0000) >> 18);
        csd->cSizeMult = (uint8_t)((rawCsd[1] & 0x38000) >> 15);
        card->blockCount = (csd->cSize + 1) <<  (csd->cSizeMult + 2);
        card->blockSize = CARD_BLOCK_LEN(csd->readBlkLen);
        if (card->blockSize != FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE)
        {
            card->blockCount = card->blockCount * card->blockSize; 
            card->blockSize = FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE;
            card->blockCount = card->blockCount / card->blockSize;
        }
    }
    else if (csd->csdStructure == 1)
    {
        card->blockSize = FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE;
        csd->cSize = (uint32_t)((rawCsd[2] & 0x3F) << 16);
        csd->cSize |= (uint32_t)((rawCsd[1] & 0xFFFF0000U) >> 16);
        if (csd->cSize >= 0xFFFF)
        {
            card->caps |= SDMMC_CARD_CAPS_SDXC;
        }
        card->blockCount = (csd->cSize + 1) * 1024;
    }

    if ((uint8_t)((rawCsd[1] & 0x4000) >> 14))
    {
        csd->flags |= SDCARD_CSD_ERASE_BLK_ENABLED;
    }

    csd->sectorSize = (uint8_t)((rawCsd[1] & 0x3F80) >> 7);
    csd->wpGrpSize = (uint8_t)(rawCsd[1] & 0x7F);
    if ((uint8_t)(rawCsd[0] & 0x80000000U))
    {
        csd->flags |= SDCARD_CSD_WP_GRP_ENABLED;
    }
    csd->r2wFactor = (uint8_t)((rawCsd[0] & 0x1C000000) >> 26);
    csd->writeBlkLen = (uint8_t)((rawCsd[0] & 0x3C00000) >> 22);
    if ((uint8_t)((rawCsd[0] & 0x200000) >> 21))
    {
        csd->flags |= SDCARD_CSD_WRITE_BL_PARTIAL;
    }
    if ((uint8_t)((rawCsd[0] & 0x8000) >> 15))
    {
        csd->flags |= SDCARD_CSD_FILE_FORMAT_GROUP;
    }
    if ((uint8_t)((rawCsd[0] & 0x4000) >> 14))
    {
        csd->flags |= SDCARD_CSD_COPY;
    }
    if ((uint8_t)((rawCsd[0] & 0x2000) >> 13))
    {
        csd->flags |= SDCARD_CSD_PERM_WRITE_PROTECT;
    }
    if ((uint8_t)((rawCsd[0] & 0x1000) >> 12))
    {
        csd->flags |= SDCARD_CSD_TMP_WRITE_PROTECT;
    }
    csd->fileFormat = (uint8_t)((rawCsd[0] & 0xC00) >> 10);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_DecodeCid
 * Description: decode cid register
 *
 *END*********************************************************************/
static void SDCARD_DRV_DecodeCid(uint32_t *rawCid, sdhc_card_t *card)
{
    sdcard_cid_t *cid;
    assert(rawCid);
    assert(card);
    cid = &(card->cid);

    cid->mid = (uint8_t)((rawCid[3] & 0xFF000000) >> 24);

