jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
    cid->oid = (uint16_t)((rawCid[3] & 0xFFFF00) >> 8);

    cid->pnm[0] = (uint8_t)((rawCid[3] & 0xFF));
    cid->pnm[1] = (uint8_t)((rawCid[2] & 0xFF000000U) >> 24);
    cid->pnm[2] = (uint8_t)((rawCid[2] & 0xFF0000) >> 16);
    cid->pnm[3] = (uint8_t)((rawCid[2] & 0xFF00) >> 8);
    cid->pnm[4] = (uint8_t)((rawCid[2] & 0xFF));

    cid->prv = (uint8_t)((rawCid[1] & 0xFF000000U) >> 24);

    cid->psn = (uint32_t)((rawCid[1] & 0xFFFFFF) << 8);
    cid->psn |= (uint32_t)((rawCid[0] & 0xFF000000U) >> 24);

    cid->mdt = (uint16_t)((rawCid[0] & 0xFFF00) >> 8);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendApplicationCmd
 * Description: send application command to card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendApplicationCmd(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_status_t ret = kStatus_SDHC_NoError;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kAppCmd;
    req->argument = 0;
    if (card->cardType != kCardTypeUnknown)
    {
        req->argument = card->rca << 16;
    }
    req->respType = kSdhcRespTypeR1;

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        if (req->error & FSL_SDHC_REQ_ERR_CMD_TIMEOUT)
        {
            ret = kStatus_SDHC_TimeoutError;
        }
        else
        {
            ret = kStatus_SDHC_RequestFailed;
        }
        OSA_MemFree(req);
        req = NULL;
        return ret;
    }

    if (!(req->response[0] & SDMMC_R1_APP_CMD))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_CardNotSupport;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}
/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_AllSendCid
 * Description: send all_send_cid command
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_AllSendCid(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kAllSendCid;
    req->argument = 0;
    req->respType = kSdhcRespTypeR2;
    if (kStatus_SDHC_NoError ==
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        memcpy(card->rawCid, req->response, sizeof(card->rawCid));
        SDCARD_DRV_DecodeCid(req->response, card);
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_NoError;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_RequestFailed;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendRca
 * Description: send rca command to card to get relative card address
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendRca(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSdSendRelativeAddr;
    req->argument = 0;
    req->respType = kSdhcRespTypeR6;
    if (kStatus_SDHC_NoError ==
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        card->rca = req->response[0] >> 16;
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_NoError;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_RequestFailed;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendCsd
 * Description: get csd from card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendCsd(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSendCsd;
    req->argument = card->rca << 16;
    req->respType = kSdhcRespTypeR2;
    if (kStatus_SDHC_NoError ==
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        memcpy(card->rawCsd, req->response, sizeof(card->rawCsd));
        SDCARD_DRV_DecodeCsd(req->response, card);
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_NoError;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_RequestFailed;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SelectCard
 * Description: select or deselect card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SelectCard(sdhc_card_t *card, bool isSelected)
{
    sdhc_request_t *req = 0;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSelectCard;
    if (isSelected)
    {
        req->argument = card->rca << 16;
        req->respType = kSdhcRespTypeR1;
    }
    else
    {
        req->argument = 0;
        req->respType = kSdhcRespTypeNone;
    }
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SetBlockSize
 * Description:  Set the block length in bytes for SDSC cards. For SDHC cards,
 * it does not affect memory read or write commands, always 512 bytes fixed
 * block length is used.
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SetBlockSize(sdhc_card_t *card, uint32_t blockSize)
{
    sdhc_request_t *req = 0;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSetBlockLen;
    req->argument = blockSize;
    req->respType = kSdhcRespTypeR1;

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }

    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Switch
 * Description: send switch command to card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_Switch(sdhc_card_t *card,
                                       uint32_t mode,
                                       uint32_t group,
                                       uint32_t value,
                                       uint32_t *resp)
{
    sdhc_request_t *req = 0;
    sdhc_data_t data = {0};
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->data = &data;

