jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
    req->cmdIndex = kSdSwitch;
    req->argument = mode << 31 | 0x00FFFFFF;
    req->argument &= ~((uint32_t)(0xF) << (group * 4));
    req->argument |= value << (group * 4);
    req->flags = FSL_SDHC_REQ_FLAGS_DATA_READ;
    req->respType = kSdhcRespTypeR1;


    data.blockSize = 64;
    data.blockCount = 1;
    data.buffer = resp;
    data.req = req;

    if (kStatus_SDHC_NoError != SDCARD_DRV_SetBlockSize(card, data.blockSize))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_SetCardBlockSizeFailed;
    }

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_DecodeScr
 * Description: decode scr register
 *
 *END*********************************************************************/
static void SDCARD_DRV_DecodeScr(uint32_t *rawScr, sdhc_card_t *card)
{
    sdcard_scr_t *scr;
    assert(rawScr);
    assert(card);

    scr = &(card->scr);
    scr->scrStructure = (uint8_t)((rawScr[0] & 0xF0000000U) >> 28);
    scr->sdSpec = (uint8_t)((rawScr[0] & 0xF000000) >> 24);
    if ((uint8_t)((rawScr[0] & 0x800000) >> 23))
    {
        scr->flags |= SDCARD_SCR_DATA_STAT_AFTER_ERASE;
    }
    scr->sdSecurity = (uint8_t)((rawScr[0] & 0x700000) >> 20);
    scr->sdBusWidths = (uint8_t)((rawScr[0] & 0xF0000) >> 16);
    if ((uint8_t)((rawScr[0] & 0x8000) >> 15))
    {
        scr->flags |= SDCARD_SCR_SD_SPEC3;
    }
    scr->exSecurity = (uint8_t)((rawScr[0] & 0x7800) >> 10);
    scr->cmdSupport = (uint8_t)(rawScr[0] & 0x3);
    scr->reservedForMan = rawScr[1];

    switch(scr->sdSpec)
    {
        case 0:
            card->version = SDMMC_SD_VERSION_1_0;
            break;
        case 1:
            card->version = SDMMC_SD_VERSION_1_1;
            break;
        case 2:
            card->version = SDMMC_SD_VERSION_2_0;
            if (card->scr.flags & SDCARD_SCR_SD_SPEC3)
            {
                card->version = SDMMC_SD_VERSION_3_0;
            }
            break;
        default:
            break;
    }
    if (card->scr.sdBusWidths & SD_SCR_BUS_WIDTHS_4BIT)
    {
        card->caps |= SDMMC_CARD_CAPS_BUSWIDTH_4BITS;
    }
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendScr
 * Description: fetch scr register from card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendScr(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_data_t data = {0};
    sdhc_status_t err = kStatus_SDHC_NoError;
    uint32_t rawScr[2] = {0};
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    err = SDCARD_DRV_SendApplicationCmd(card);
    if (err)
    {
        OSA_MemFree(req);
        req = NULL;
        return err;
    }

    req->data = &data;
    req->cmdIndex = kSdAppSendScr;
    req->flags = FSL_SDHC_REQ_FLAGS_DATA_READ;
    req->respType = kSdhcRespTypeR1;
    req->argument = 0;

    data.blockSize = 8;
    data.blockCount = 1;
    data.buffer = rawScr;
    data.req = req;

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    rawScr[0] = swap_be32(rawScr[0]);
    rawScr[1] = swap_be32(rawScr[1]);
    memcpy(card->rawScr, rawScr, sizeof(card->rawScr));
    SDCARD_DRV_DecodeScr(rawScr, card);
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SwitchHighspeed
 * Description: switch high speed mode of the specific card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SwitchHighspeed(sdhc_card_t *card)
{
    uint32_t response[16] = {0};
    sdhc_status_t err = kStatus_SDHC_NoError;
    assert(card);

    if ((card->version < SDMMC_SD_VERSION_1_1)
         || (!(card->csd.ccc & SD_CCC_SWITCH)))
    {
        return kStatus_SDHC_CardNotSupport;
    }

    err = SDCARD_DRV_Switch(card, kSdSwitchCheck, 0, 1, response);
    if (err)
    {
        return err;
    }

    if ((!(swap_be32(response[3]) & 0x10000)) ||
        ((swap_be32(response[4]) & 0x0f000000) == 0x0F000000))
    {
        return kStatus_SDHC_CardNotSupport;
    }

    err = SDCARD_DRV_Switch(card, kSdSwitchSet, 0, 1, response);
    if (err)
    {
        return err;
    }

    if ((swap_be32(response[4]) & 0x0f000000) != 0x01000000)
    {
        err = kStatus_SDHC_SwitchFailed;
    }

    return err;

}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SetBusWidth
 * Description: set desired buswidth
 *
 *END*********************************************************************/
static uint32_t SDCARD_DRV_SetBusWidth(sdhc_card_t *card,
                                       sd_buswidth_t busWidth)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err = kStatus_SDHC_NoError;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    err = SDCARD_DRV_SendApplicationCmd(card);
    if (err != kStatus_SDHC_NoError)
    {
        OSA_MemFree(req);
        req = NULL;
        return err;
    }

    req->cmdIndex = kSdAppSetBusWdith;
    req->respType = kSdhcRespTypeR1;
    req->argument = busWidth;

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    OSA_MemFree(req);
    req = NULL;
    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_InitSd
 * Description: initialize SD memory card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_InitSd(sdhc_card_t *card)
{
    assert(card);
    sdhc_status_t err = kStatus_SDHC_NoError;
    card->cardType = kCardTypeSd;

    if (kStatus_SDHC_NoError != SDCARD_DRV_AllSendCid(card))
    {
        return kStatus_SDHC_AllSendCidFailed;
    }

