jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
    if (kStatus_SDHC_NoError != SDCARD_DRV_SendRca(card))
    {
        return kStatus_SDHC_SendRcaFailed;
    }

    if (kStatus_SDHC_NoError != SDCARD_DRV_SendCsd(card))
    {
        return kStatus_SDHC_SendCsdFailed;
    }

    if (kStatus_SDHC_NoError != SDCARD_DRV_SelectCard(card, true))
    {
        return kStatus_SDHC_SelectCardFailed;
    }

    if (kStatus_SDHC_NoError != SDCARD_DRV_SendScr(card))
    {
        return kStatus_SDHC_SendScrFailed;
    }

    if (kStatus_SDHC_NoError !=
            SDHC_DRV_ConfigClock(card->hostInstance, SDMMC_CLK_25MHZ))
    {
        return kStatus_SDHC_SetClockFailed;
    }

    if (DOES_HOST_SUPPORT_4BITS(card->host) && DOES_CARD_SUPPORT_4BITS(card))
    {
        if (kStatus_SDHC_NoError != SDCARD_DRV_SetBusWidth(card, kSdBusWidth4Bit))
        {
            return kStatus_SDHC_SetCardWideBusFailed;
        }
        if (kStatus_SDHC_NoError !=
                SDHC_DRV_SetBusWidth(card->hostInstance, kSdhcBusWidth4Bit))
        {
            return kStatus_SDHC_SetBusWidthFailed;
        }
    }

    if (DOES_HOST_SUPPORT_HIGHSPEED(card->host))
    {
        err = SDCARD_DRV_SwitchHighspeed(card);
        if ((err != kStatus_SDHC_NoError) && (kStatus_SDHC_CardNotSupport != err))
        {
            return kStatus_SDHC_SwitchHighSpeedFailed;
        }
        else if (err == kStatus_SDHC_NoError)
        {
            if (kStatus_SDHC_NoError !=
                    SDHC_DRV_ConfigClock(card->hostInstance, SDMMC_CLK_50MHZ))
            {
                return kStatus_SDHC_SetClockFailed;
            }
        }
        else
        {
            err = kStatus_SDHC_NoError;
        }
    }

    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_AppSendOpCond
 * Description: Send host capacity support information and asks the accessed
 * card to send its operating condition register content.
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_AppSendOpCond(sdhc_card_t *card,
                                              uint32_t acmd41Arg)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err;
    uint32_t i = FSL_SDHC_CARD_MAX_VOLT_RETRIES;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSdAppSendOpCond;
    req->argument = acmd41Arg;
    req->respType = kSdhcRespTypeR3;

    while (i--)
    {
        err = SDCARD_DRV_SendApplicationCmd(card);
        if (err != kStatus_SDHC_NoError)
        {
            OSA_MemFree(req);
            req = NULL;
            return err;
        }

        if (kStatus_SDHC_NoError !=
                SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                              req,
                                              FSL_SDCARD_REQUEST_TIMEOUT))
        {
            OSA_MemFree(req);
            req = NULL;
            return err;
        }

        if (req->response[0] & SDMMC_CARD_BUSY)
        {
            if (req->response[0] & SD_OCR_CCS)
            {
                card->caps |= SDMMC_CARD_CAPS_HIGHCAPACITY;
            }
            err = kStatus_SDHC_NoError;
            card->ocr = req->response[0];
            break;
        }
        err = kStatus_SDHC_TimeoutError;
        OSA_TimeDelay(10);
    }

    OSA_MemFree(req);
    req = NULL;
    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_GoIdle
 * Description: reset all cards to idle state
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_GoIdle(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kGoIdleState;
    err = SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                        req,
                                        FSL_SDCARD_REQUEST_TIMEOUT);
    OSA_MemFree(req);
    req = NULL;
    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_CheckReadOnly
 * Description: Check if the card is ready only
 *
 *END*********************************************************************/
bool SDCARD_DRV_CheckReadOnly(sdhc_card_t *card)
{
    assert(card);

    return ((card->csd.flags & SDCARD_CSD_PERM_WRITE_PROTECT) ||
            (card->csd.flags & SDCARD_CSD_TMP_WRITE_PROTECT));
}



/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendIfCond
 * Description: check card interface condition, which includes host supply
 * voltage information and asks the card whether card supports voltage.
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendIfCond(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err = kStatus_SDHC_NoError;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSdSendIfCond;
    req->argument = 0x1AA;
    req->respType = kSdhcRespTypeR7;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        err = kStatus_SDHC_RequestFailed;
    }
    else if ((req->response[0] & 0xFF) != 0xAA)
    {
        err = kStatus_SDHC_CardNotSupport;
    }
    OSA_MemFree(req);
    req = NULL;
    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_SendStatus
 * Description:  send the sd status
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_SendStatus(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err = kStatus_SDHC_NoError;
    uint32_t timeout = 1000;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    req->cmdIndex = kSendStatus;
    req->argument = card->rca << 16;
    req->respType = kSdhcRespTypeR1;
    do
    {
        if (kStatus_SDHC_NoError !=
                SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                              req,
                                              FSL_SDCARD_REQUEST_TIMEOUT))
        {
            OSA_MemFree(req);
            req = NULL;
            return kStatus_SDHC_RequestFailed;
        }
        if ((req->response[0] & SDMMC_R1_READY_FOR_DATA)
             && (SDMMC_R1_CURRENT_STATE(req->response[0]) != SDMMC_R1_STATE_PRG))
        {
            break;
        }
        OSA_TimeDelay(1);
    } while(timeout--);

    if (!timeout)
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_TimeoutError;
    }

    OSA_MemFree(req);
    req = NULL;
    return err;
}

#if ! defined BSP_FSL_SDHC_ENABLE_AUTOCMD12
/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_StopTransmission
 * Description:  Send stop transmission command to card to stop ongoing
 * data transferring.
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_StopTransmission(sdhc_card_t *card)
{
    sdhc_request_t *req = 0;
    sdhc_status_t err = kStatus_SDHC_NoError;
    assert(card);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }

    req->cmdIndex = kStopTransmission;
    req->argument = 0;
    req->respType = kSdhcRespTypeR1b;
    req->data = 0;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }

    OSA_MemFree(req);
    req = NULL;
    return err;
}
#endif

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Read
 * Description: read data from specific card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_Read(sdhc_card_t *card,
                                     uint8_t *buffer,
                                     uint32_t startBlock,
                                     uint32_t blockSize,
                                     uint32_t blockCount)
{
    sdhc_request_t *req = 0;
    sdhc_data_t data = {0};

