jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
    assert(card);
    assert(buffer);
    assert(blockCount);
    assert(blockSize);

    if ((blockCount + startBlock) >
            ((uint64_t)(card->blockCount * card->blockSize)) / blockSize)
    {
        return kStatus_SDHC_InvalidIORange;
    }

    if ((IS_HIGHCAPACITY_CARD(card) && (blockSize != 512))
         || (blockSize > card->blockSize)
         || (blockSize > card->host->maxBlockSize)
         || (blockSize % 4))
    {
        return kStatus_SDHC_BlockSizeNotSupportError;
    }

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    data.blockSize = blockSize;
    data.blockCount = blockCount;
    data.buffer = (uint32_t *)buffer;

    if (SDCARD_DRV_SetBlockSize(card, data.blockSize))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_SetCardBlockSizeFailed;
    }

    req->data = &data;
    req->cmdIndex = kReadMultipleBlock;
    if (data.blockCount == 1)
    {
        req->cmdIndex = kReadSingleBlock;
    }

    req->argument = startBlock;
    if (!IS_HIGHCAPACITY_CARD(card))
    {
        req->argument *= data.blockSize;
    }
    req->flags = FSL_SDHC_REQ_FLAGS_DATA_READ;
    req->respType = kSdhcRespTypeR1;

    data.req = req;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }

#if ! defined BSP_FSL_SDHC_ENABLE_AUTOCMD12
    if (data.blockCount > 1)
    {
        if (kStatus_SDHC_NoError != SDCARD_DRV_StopTransmission(card))
        {
            OSA_MemFree(req);
            req = NULL;
            return kStatus_SDHC_StopTransmissionFailed;
        }
    }
#endif
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Write
 * Description: write data from specific card
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_Write(sdhc_card_t *card,
                                      uint8_t *buffer,
                                      uint32_t startBlock,
                                      uint32_t blockSize,
                                      uint32_t blockCount)
{
    sdhc_request_t *req = 0;
    sdhc_data_t data = {0};
    assert(card);
    assert(buffer);
    assert(blockCount);
    assert(blockSize);

    if ((blockCount + startBlock) >
            ((uint64_t)(card->blockCount * card->blockSize)) / blockSize)
    {
        return kStatus_SDHC_InvalidIORange;
    }

    if ((IS_HIGHCAPACITY_CARD(card) && (blockSize != 512))
         || (blockSize > card->blockSize)
         || (blockSize > card->host->maxBlockSize)
         || (blockSize % 4))
    {
        return kStatus_SDHC_BlockSizeNotSupportError;
    }

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }

    if (SDCARD_DRV_SetBlockSize(card, blockSize))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_SetCardBlockSizeFailed;
    }

    data.blockSize = blockSize;
    data.blockCount = blockCount;
    data.buffer = (uint32_t *)buffer;

    req->data = &data;
    req->cmdIndex = kWriteMultipleBlock;
    if (data.blockCount == 1)
    {
        req->cmdIndex = kWriteBlock;
    }

    req->argument = startBlock;
    if (!IS_HIGHCAPACITY_CARD(card))
    {
        req->argument *= data.blockSize;
    }
    req->respType = kSdhcRespTypeR1;
    data.req = req;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }

    if (data.blockCount > 1)
    {
#if ! defined BSP_FSL_SDHC_ENABLE_AUTOCMD12
        if (kStatus_SDHC_NoError != SDCARD_DRV_StopTransmission(card))
        {
            OSA_MemFree(req);
            req = NULL;
            return kStatus_SDHC_StopTransmissionFailed;
        }
#endif
        if (kStatus_SDHC_NoError != SDCARD_DRV_SendStatus(card))
        {
            OSA_MemFree(req);
            req = NULL;
            return kStatus_SDHC_SendCardStatusFailed;
        }
    }
    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Erase
 * Description: erase data for the given block range
 *
 *END*********************************************************************/
static sdhc_status_t SDCARD_DRV_Erase(sdhc_card_t *card,
                                      uint32_t startBlock,
                                      uint32_t blockCount)
{
    uint32_t s, e;
    sdhc_request_t *req = 0;
    assert(card);
    assert(blockCount);

    req = (sdhc_request_t *)OSA_MemAllocZero(sizeof(sdhc_request_t));
    if (req == NULL)
    {
        return kStatus_SDHC_OutOfMemory;
    }
    s = startBlock;
    e = s + blockCount - 1;
    if (!IS_HIGHCAPACITY_CARD(card))
    {
        s = s * FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE;
        e = e * FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE;
    }

    req->cmdIndex = kSdEraseWrBlkStart;
    req->argument = s;
    req->respType = kSdhcRespTypeR1;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    req->cmdIndex = kSdEraseWrBlkEnd;
    req->argument = e;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }
    req->cmdIndex = kErase;
    req->argument = 0;
    req->respType = kSdhcRespTypeR1b;
    if (kStatus_SDHC_NoError !=
            SDHC_DRV_IssueRequestBlocking(card->hostInstance,
                                          req,
                                          FSL_SDCARD_REQUEST_TIMEOUT))
    {
        OSA_MemFree(req);
        req = NULL;
        return kStatus_SDHC_RequestFailed;
    }

    OSA_MemFree(req);
    req = NULL;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Shutdown
 * Description: destory initialized card and shutdown the corresponding
 * host controller
 *
 *END*********************************************************************/
void SDCARD_DRV_Shutdown(sdhc_card_t *card)
{
    assert(card);
    SDCARD_DRV_SelectCard(card, false);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_Init
 * Description: initialize card on the given host controller
 *
 *END*********************************************************************/
sdhc_status_t SDCARD_DRV_Init(sdhc_host_t *host, sdhc_card_t *card)
{
    sdhc_status_t err = kStatus_SDHC_NoError;
    uint32_t acmd41Arg;
    assert(card);
    assert(host);

