jamesmunns/kinetis-rs/platform/drivers/sdcard/src/fsl_sdhc_card.c
    card->cardType = kCardTypeUnknown;
    card->host = host;
    card->hostInstance = host->instance;

    if (SDHC_DRV_ConfigClock(card->hostInstance, SDMMC_CLK_400KHZ))
    {
        return kStatus_SDHC_SetClockFailed;
    }

    err = SDCARD_DRV_GoIdle(card);
    if (err)
    {
        return kStatus_SDHC_SetCardToIdle;
    }
    acmd41Arg = card->host->ocrSupported;

    err = SDCARD_DRV_SendIfCond(card);
    if (err == kStatus_SDHC_NoError)
    {
        /* SDHC or SDXC card */
        acmd41Arg |= SD_OCR_HCS;
        card->caps |= SDMMC_CARD_CAPS_SDHC;
    }
    else
    {
        /* SDSC card */
        err = SDCARD_DRV_GoIdle(card);
        if (err)
        {
            return kStatus_SDHC_SetCardToIdle;
        }
    }

    err = SDCARD_DRV_AppSendOpCond(card, acmd41Arg);
    if (kStatus_SDHC_TimeoutError == err)
    {
        /* MMC card */
        return kStatus_SDHC_NotSupportYet;
    }
    else if (err)
    {
        return kStatus_SDHC_SendAppOpCondFailed;
    }

    return SDCARD_DRV_InitSd(card);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_WriteBlocks
 * Description: write blocks to card with default block size
 *
 *END*********************************************************************/
sdhc_status_t SDCARD_DRV_WriteBlocks(sdhc_card_t *card,
                                     uint8_t *buffer,
                                     uint32_t startBlock,
                                     uint32_t blockCount)
{
    uint32_t blkCnt, blkLeft, blkDone;
    sdhc_status_t err = kStatus_SDHC_NoError;

    assert(card);
    assert(buffer);
    assert(blockCount);

    blkLeft = blockCount;
    blkDone = 0;

    if ((blockCount + startBlock) > card->blockCount)
    {
        return kStatus_SDHC_InvalidIORange;
    }

    while(blkLeft)
    {
        if (blkLeft > card->host->maxBlockCount)
        {
            blkLeft = blkLeft - card->host->maxBlockCount;
            blkCnt = card->host->maxBlockCount;
        }
        else
        {
            blkCnt = blkLeft;
            blkLeft = 0;
        }

        err = SDCARD_DRV_Write(card,
                          buffer + blkDone * FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE,
                          startBlock + blkDone,
                          FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE,
                          blkCnt);
        if (err != kStatus_SDHC_NoError)
        {
            return err;
        }
        blkDone += blkCnt;
    }

    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_ReadBlocks
 * Description: read blocks from card with default block size
 *
 *END*********************************************************************/
sdhc_status_t SDCARD_DRV_ReadBlocks(sdhc_card_t *card,
                                    uint8_t *buffer,
                                    uint32_t startBlock,
                                    uint32_t blockCount)
{
    uint32_t blkCnt, blkLeft, blkDone;
    sdhc_status_t err = kStatus_SDHC_NoError;

    assert(card);
    assert(buffer);
    assert(blockCount);

    blkLeft = blockCount;
    blkDone = 0;

    if ((blockCount + startBlock) > card->blockCount)
    {
        return kStatus_SDHC_InvalidIORange;
    }

    while(blkLeft)
    {
        if (blkLeft > card->host->maxBlockCount)
        {
            blkLeft = blkLeft - card->host->maxBlockCount;
            blkCnt = card->host->maxBlockCount;
        }
        else
        {
            blkCnt = blkLeft;
            blkLeft = 0;
        }

        err = SDCARD_DRV_Read(card,
                          buffer + blkDone * FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE,
                          startBlock + blkDone,
                          FSL_SDHC_CARD_DEFAULT_BLOCK_SIZE,
                          blkCnt);
        if (err != kStatus_SDHC_NoError)
        {
            return err;
        }
        blkDone += blkCnt;
    }

    return err;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDCARD_DRV_EraseBlocks
 * Description: erase block range from card with default block size
 *
 *END*********************************************************************/
sdhc_status_t SDCARD_DRV_EraseBlocks(sdhc_card_t *card,
                                     uint32_t startBlock,
                                     uint32_t blockCount)
{
    uint32_t blkDone = 0, blkLeft, blkCnt;

    assert(card);
    assert(blockCount);

    blkLeft = blockCount;
    while(blkLeft)
    {
        if (blkLeft > (card->csd.sectorSize + 1))
        {
            blkCnt = card->csd.sectorSize + 1;
            blkLeft = blkLeft - blkCnt;
        }
        else
        {
            blkCnt = blkLeft;
            blkLeft = 0;
        }

        if (kStatus_SDHC_NoError != SDCARD_DRV_Erase(card,
                                                     startBlock + blkDone,
                                                     blkCnt))
        {
            return kStatus_SDHC_CardEraseBlocksFailed;
        }

        if (kStatus_SDHC_NoError != SDCARD_DRV_SendStatus(card))
        {
            return kStatus_SDHC_SendCardStatusFailed;
        }
        blkDone += blkCnt;
    }
    return kStatus_SDHC_NoError;
}
